### Carga de datos usando la función read_csv

In [1]:
import pandas as pd
import os

In [3]:
mainpath = "/JupyterNotebooks/machine_learning/datasets/"
filename = "titanic/titanic3.csv"
fullpath = os.path.join(mainpath,filename)

In [4]:
data = pd.read_csv(fullpath)

In [5]:
data.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

### Argumentos de la funcion read_csv 
* sep : separador de columnas, puede ser una Exp Reg
* dtype: especificar el tipo de datos de cada columna, dtype=("a":np.float64); la col "a"  se carga como float
* header: para especificar que fila es la cabecera del dataset, por defecto se usa la 1era fila
* name: array o lita para nombrar o renombrar las columnas de un dataset
* skiprows: para saltar a una fila especifica
* index_col  indicar una columna especifica como identificador
* skip_blank_lines : para saltarse valores en blanco o NaN
* nan_filter: elimina cualquier fila que tenga valores NaN o strings vacios, mucho cuidado con esta!!

  read.csv(**filepath**="/JupyterNotebooks/machine_learning/datasets/titanic/titanic3.csv", **sep**=",", **dtype**=None, **header**=0, **names**={"nameA","nameB"}, **skiprows**=12, **index_col**=None, **skip_blank_lines**=True, **na_filte**=False)

### Obtener de dos archivos distintos las cabeceras y las filas de un dataset

In [ ]:
#obtengo un dataset .txt, read_csv() lo lee porque ya esta separado por comas
data2 = pd.read_csv(mainpath+"/"+"customer-churn-model/Customer Churn Model.txt")

In [ ]:
#se verifica que el dataset cargo corectamente y vemos los nombres originales de sus cabeceras
data2.head()

In [ ]:
#esta es la lista de cabeceras originales del dataset
data2.columns.values

In [ ]:
#obtengo otro grupo de cabeceras desde otro archivo y las transformo en una lista
data_cols = pd.read_csv(mainpath + "/" +"customer-churn-model/Customer Churn Columns.csv")
data_col_list = data_cols["Column_Names"].tolist()
data_col_list

#ahora uso esa lista para sustituir las cabeceras originales del dataset
data2 = pd.read_csv(mainpath+"/"+"customer-churn-model/Customer Churn Model.txt",
                    header = None, names = data_col_list)
data2.columns.values

### Carga de grandes archivos con la funcion OPEN
extrae los datos del archivo linea a linea, y se pude ir almacenando, de forma manual con distintas operaciones para obtener el mismo resultado que con read_csv() pero en archivos de gran tamaño. Hay que tener cuidado al abrir un fichero en modo "w" (escritura) ya que esto hará que dicho fichero pierda su contenido (en caso de tenerlo y querer conservarlo). Si por algún motivo se quiere agregar contenido a este es recomendable abrirlo en modo "a" (append), lo cual posicionará el cursor al final y no borrará el contenido del mismo.

In [14]:
##abrimos en modo solo lectura "r"
data3 = open(mainpath + "/"+"customer-churn-model/Customer Churn Model.txt","r")

In [15]:
#next() va a la siguiente fila del archivo,que sigue de la cabecera,
#strip, elimina espacios en blanco al inicio y al final de la fila
#split() divide usando la , asi obtenemos las columnas del dataset
cols = data3.readline().strip().split(",")
n_cols = len(cols)

In [16]:
#se crea un diccionario, se parte por las cabeceras extraidas en cols y por cada cabecera un array vacio que 
#luego se rellenara con los datos, quedando una estructura estilo JSON
counter = 0
main_dict ={}
for col in cols:
    main_dict[col] =[]

In [18]:
#rellenar el diccionario leyendo cada linea del dataset (line), esquema de lectura y llenado de matriz NxN
for line in data3:
    #cada valor se obtendra de cada linea del dataset quitando espacios vacios y dividido por comas, como antes
    values = line.strip().split(",") 
    #cada [] del diccionario sera un array con los valores leidos y procesados desde el dataset
    for i in range(len(cols)):
        main_dict[cols[i]].append(values[i])
    counter +=1
print("El dataset tiene %d filas y %d columnas" %(counter,n_cols))

El dataset tiene 3333 filas y 21 columnas

In [19]:
#creamos un dataframe de panda y el resultado es el mismo que con la funcion read_csv, recordar que esto es para grandes
#datasets que podrian ser cargados en partes, o incluso en distintas maquinas y hacer la carga manual de datos
df3 = pd.DataFrame(main_dict)
df3.head()

,Account Length,Area Code,Churn?,CustServ Calls,Day Calls,Day Charge,Day Mins,Eve Calls,Eve Charge,Eve Mins,...,Intl Calls,Intl Charge,Intl Mins,Night Calls,Night Charge,Night Mins,Phone,State,VMail Message,VMail Plan
0,128,415,False.,1,110,45.070000,265.100000,99,16.780000,197.400000,...,3,2.700000,10.000000,91,11.010000,244.700000,382-4657,KS,25,yes
1,107,415,False.,1,123,27.470000,161.600000,103,16.620000,195.500000,...,3,3.700000,13.700000,103,11.450000,254.400000,371-7191,OH,26,yes
2,137,415,False.,0,114,41.380000,243.400000,110,10.300000,121.200000,...,5,3.290000,12.200000,104,7.320000,162.600000,358-1921,NJ,0,no
3,84,408,False.,2,71,50.900000,299.400000,88,5.260000,61.900000,...,7,1.780000,6.600000,89,8.860000,196.900000,375-9999,OH,0,no
4,75,415,False.,3,113,28.340000,166.700000,122,12.610000,148.300000,...,3,2.730000,10.100000,121,8.410000,186.900000,330-6626,OK,0,no

### Lectura y escritura de archivos 
usaremos el archivo anterior para crear un nuevo archivo igual pero que usa el tabulador "/t" como separador

In [20]:
infile =  mainpath + "/" +"customer-churn-model/Customer Churn Model.txt"
outfile = mainpath + "/" +"customer-churn-model/Tab Customer Churn Model.txt"

In [28]:
with open(infile,"r") as infile1:
    with open(outfile,"w") as outfile1:
        for line in infile1:
            fields = line.strip().split(",")#lee cada linea del archivo original separada por comas
            outfile1.write("\t".join(fields))#escribe cada linea anterior en el nuevo archivo, separadas por tabulador
            outfile1.write("\n") #intro para pasar de linea

In [29]:
#si usamos read_csv indicando el separador "\t" el resultado sigue siendo el mismo
df4 = pd.read_csv(outfile,sep="\t")
df4.head()

,State,Account Length,Area Code,Phone,Int'l Plan,VMail Plan,VMail Message,Day Mins,Day Calls,Day Charge,...,Eve Calls,Eve Charge,Night Mins,Night Calls,Night Charge,Intl Mins,Intl Calls,Intl Charge,CustServ Calls,Churn?
0,KS,128,415,382-4657,no,yes,25,265.1,110,45.07,...,99,16.78,244.7,91,11.01,10.0,3,2.70,1,False.
1,OH,107,415,371-7191,no,yes,26,161.6,123,27.47,...,103,16.62,254.4,103,11.45,13.7,3,3.70,1,False.
2,NJ,137,415,358-1921,no,no,0,243.4,114,41.38,...,110,10.30,162.6,104,7.32,12.2,5,3.29,0,False.
3,OH,84,408,375-9999,yes,no,0,299.4,71,50.90,...,88,5.26,196.9,89,8.86,6.6,7,1.78,2,False.
4,OK,75,415,330-6626,yes,no,0,166.7,113,28.34,...,122,12.61,186.9,121,8.41,10.1,3,2.73,3,False.

### Leer datos desde una url externa

In [30]:
#usando pandas
medals_url = "http://winterolympicsmedals.com/medals.csv"
medals_data = pd.read_csv(medals_url)
medals_data.head()

,Year,City,Sport,Discipline,NOC,Event,Event gender,Medal
0,1924,Chamonix,Skating,Figure skating,AUT,individual,M,Silver
1,1924,Chamonix,Skating,Figure skating,AUT,individual,W,Gold
2,1924,Chamonix,Skating,Figure skating,AUT,pairs,X,Gold
3,1924,Chamonix,Bobsleigh,Bobsleigh,BEL,four-man,M,Bronze
4,1924,Chamonix,Ice Hockey,Ice Hockey,CAN,ice hockey,M,Gold

In [31]:
import csv
import urllib3

### Leer archivos XLS y XSLX

In [32]:
mainpath = "/JupyterNotebooks/machine_learning/datasets/"
filename = "titanic/titanic3.xls"
titanic2 = pd.read_excel(mainpath+"/"+filename,"titanic3")
titanic2.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [34]:
#creo un archivo .csv a partir de un dataframe, y tambien se puede crear un excel o csv o json
titanic2.to_csv(mainpath + "/titanic/titanic_custom2.csv")

In [35]:
titanic2.to_excel(mainpath + "/titanic/titanic_custom3.xls")

In [36]:
titanic2.to_json(mainpath + "/titanic/titanic_custom4.json")